particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
    return 0;
}

int erase_common(uintptr_t start_addr, size_t num_blocks, nrf_qspi_erase_len_t len) {
    FlashLock lk;

    int err_code = NRF_SUCCESS;

    const size_t block_length = len == NRF_QSPI_ERASE_LEN_4KB ? 4096 : 64 * 1024;

    /* Round down to the nearest block */
    start_addr = ((start_addr / block_length) * block_length);

    for (size_t i = 0; i < num_blocks; i++) {
        err_code = nrfx_qspi_erase(len, start_addr);
        CHECK_NRF_RETURN(err_code, nrf_system_error(err_code));

        exflash_qspi_wait_completion();

        start_addr += block_length;
    }

    // LOG_DEBUG(TRACE, "Erased %lu %lukB blocks starting from %" PRIxPTR,
    //           num_blocks, block_length / 1024, start_addr);

    return 0;
}

} // Anonymous

int hal_exflash_init(void) {
    // PATCH: Initialize CS pin, external memory discharge
    nrf_gpio_cfg_output(QSPI_FLASH_CSN_PIN);
    nrf_gpio_pin_set(QSPI_FLASH_CSN_PIN);
    nrf_gpio_cfg_input(QSPI_FLASH_IO1_PIN, NRF_GPIO_PIN_PULLDOWN);

    FlashLock lk;

    // Use single data line SPI to read ID
    nrfx_qspi_config_t default_config = NRF_QSPI_QUICK_CFG(NRF_QSPI_WRITEOC_PP, NRF_QSPI_READOC_FASTREAD, NRF_QSPI_FREQ_32MDIV2);
    int ret = nrfx_qspi_init(&default_config, nullptr, nullptr);
    if (ret) {
        if (ret == NRFX_ERROR_TIMEOUT) {
            // Could have timed out because the flash chip might be in an ongoing program/erase operation or Deep Power-Down mode.
            // Suspend it or wake it up.
            LOG_DEBUG(TRACE, "QSPI NRFX timeout error. Suspend pgm/ers op or wake it up.");

            hal_qspi_flash_type_t all_flashes[] = {
                HAL_QSPI_FLASH_TYPE_MX25L3233F,
                HAL_QSPI_FLASH_TYPE_MX25R6435F,
                HAL_QSPI_FLASH_TYPE_GD25WQ64E
            };

            // Try all the supported suspend command
            for (auto flash: all_flashes) {
                flash_type = flash;
                hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SUSPEND_PGMERS, nullptr, nullptr, 0);
                nrf_delay_us(20); // Need delay to ensure the flash is suspended
            }

            // Try all the supported wake-up command
            for (auto flash: all_flashes) {
                flash_type = flash;
                hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_WAKEUP, nullptr, nullptr, 0);
                nrf_delay_us(20); // Need delay to ensure the flash is woken up.
            }

            // Temporarily set the flash type to make use of hal_exflash_special_command()
            flash_type = DEFAULT_SPI_FLASH_TYPE;
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, nullptr, nullptr, 0);
        }
        return nrf_system_error(ret);
    }

    // Determine chip type / wake up from potential sleep
    uint8_t chip_id[3] = {};

    // Temporarily set the flash type to make use of hal_exflash_special_command()
    flash_type = DEFAULT_SPI_FLASH_TYPE;
    CHECK(hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_READID, nullptr, chip_id, 0));

    flash_type = hal_exflash_get_type(chip_id);
    const hal_exflash_params_t* flash_params = hal_exflash_get_params(flash_type);
    CHECK_TRUE(flash_params, SYSTEM_ERROR_NOT_FOUND);

    // Re-initialize QSPI using corresponding flash parameters
    nrfx_qspi_uninit();
    nrfx_qspi_config_t new_config = NRF_QSPI_QUICK_CFG(flash_params->write_opcode, flash_params->read_opcode, NRF_QSPI_FREQ_32MDIV2);
    ret = nrfx_qspi_init(&new_config, nullptr, nullptr);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    qspi_state = HAL_EXFLASH_STATE_ENABLED;

    // Reset chip, put it into QSPI mode
    CHECK(hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, nullptr, nullptr, 0));

    return SYSTEM_ERROR_NONE;
}

int hal_exflash_uninit(void) {
    FlashLock lk;

    nrfx_qspi_uninit();
    // PATCH: Initialize CS pin, external memory discharge
    nrf_gpio_cfg_output(QSPI_FLASH_CSN_PIN);
    nrf_gpio_pin_set(QSPI_FLASH_CSN_PIN);
    nrf_gpio_cfg_input(QSPI_FLASH_IO1_PIN, NRF_GPIO_PIN_PULLDOWN);
    // The nrfx_qspi driver doesn't clear pending IRQ
    sd_nvic_ClearPendingIRQ(QSPI_IRQn);

    qspi_state = HAL_EXFLASH_STATE_DISABLED;

    return SYSTEM_ERROR_NONE;
}

int hal_exflash_write(uintptr_t addr, const uint8_t* data_buf, size_t data_size) {
    FlashLock lk;

    int ret = hal_flash_common_write(addr, data_buf, data_size,
                                     &perform_write, &hal_flash_common_dummy_read);
    exflash_qspi_wait_completion();
    return ret;
}

int hal_exflash_read(uintptr_t addr, uint8_t* data_buf, size_t data_size) {
    FlashLock lk;

    int ret = 0;
    {
        const uintptr_t src_aligned = ADDR_ALIGN_WORD(addr);
        uint8_t* dst_aligned = (uint8_t*)ADDR_ALIGN_WORD_RIGHT((uintptr_t)data_buf);
        const size_t unaligned_bytes = std::min(data_size, (size_t)(dst_aligned - data_buf));
        const size_t size_aligned = ADDR_ALIGN_WORD(data_size - unaligned_bytes);

        if (size_aligned > 0) {
            /* Read-out the aligned portion into an aligned address in the buffer
             * with an adjusted size in multiples of 4.
             */
            ret = nrfx_qspi_read(dst_aligned, size_aligned, src_aligned);
            CHECK_NRF_RETURN(ret, nrf_system_error(ret));

            /* Move the data if necessary */
            if (dst_aligned != data_buf || src_aligned != addr) {
                const unsigned offset_front = addr - src_aligned;
                const size_t bytes_read = size_aligned - offset_front;

                memmove(data_buf, dst_aligned + offset_front, bytes_read);

                /* Adjust addresses and size */
                addr += bytes_read;
                data_buf += bytes_read;
                data_size -= bytes_read;
            } else {
                /* Adjust addresses and size */
                addr += size_aligned;
                data_buf += size_aligned;
                data_size -= size_aligned;
            }
        }
    }

    /* Read the remaining unaligned portion into a temporary buffer and copy into
     * the destination buffer
     */
    if (data_size > 0) {
        uint8_t tmpbuf[sizeof(uint32_t) * 2] __attribute__((aligned(4)));

        /* Read the remainder */
        const uintptr_t src_aligned = ADDR_ALIGN_WORD(addr);
        const size_t size_aligned = ADDR_ALIGN_WORD_RIGHT((addr + data_size) - src_aligned);

