particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
        ret = nrfx_qspi_read(tmpbuf, size_aligned, src_aligned);
        CHECK_NRF_RETURN(ret, nrf_system_error(ret));

        const unsigned offset_front = addr - src_aligned;

        memcpy(data_buf, tmpbuf + offset_front, data_size);
    }

    return 0;
}

int hal_exflash_erase_sector(uintptr_t start_addr, size_t num_sectors) {
    return erase_common(start_addr, num_sectors, NRF_QSPI_ERASE_LEN_4KB);
}

int hal_exflash_erase_block(uintptr_t start_addr, size_t num_blocks) {
    return erase_common(start_addr, num_blocks, NRF_QSPI_ERASE_LEN_64KB);
}

int hal_exflash_copy_sector(uintptr_t src_addr, uintptr_t dest_addr, size_t data_size) {
    FlashLock lk;

    uint8_t data_buf[FLASH_OPERATION_TEMP_BLOCK_SIZE] __attribute__((aligned(4)));
    unsigned index = 0;
    uint16_t copy_len;
    uint16_t sector_num;

    if ((src_addr % sFLASH_PAGESIZE) || (dest_addr % sFLASH_PAGESIZE) || !(IS_WORD_ALIGNED(data_size))) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    // erase sectors
    sector_num = CEIL_DIV(data_size, sFLASH_PAGESIZE);
    CHECK(hal_exflash_erase_sector(dest_addr, sector_num));

    // memory copy
    for (index = 0; index < data_size; index += copy_len) {
        copy_len = std::min((data_size - index), sizeof(data_buf));
        CHECK(hal_exflash_read(src_addr + index, data_buf, copy_len));
        CHECK(hal_exflash_write(dest_addr + index, data_buf, copy_len));
    }

    return 0;
}

int hal_exflash_read_special(hal_exflash_special_sector_t sp, uintptr_t addr, uint8_t* data_buf, size_t data_size) {
    const hal_exflash_params_t* flash_params = hal_exflash_get_params(flash_type);
    CHECK_TRUE(flash_params, SYSTEM_ERROR_NOT_FOUND);

    CHECK_TRUE(sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addr + data_size <= flash_params->otp_size, SYSTEM_ERROR_OUT_OF_RANGE);
    CHECK_TRUE(data_buf != nullptr, SYSTEM_ERROR_INVALID_ARGUMENT);
    int ret = 0;

    FlashLock lk;

    if (flash_type == HAL_QSPI_FLASH_TYPE_GD25WQ64E) {
        // Determine which OTP Register to start reading from
        size_t otp_page = addr / HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
        size_t data_to_read = data_size;
        size_t data_read = 0;
        size_t read_amount = 0;

        while (data_to_read && !ret) {
            // Determine the offset of the current OTP register to start reading from
            size_t register_offset = (addr + data_read) % HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
            read_amount = data_to_read;

            // If the data remaining to read extends into the next register, truncate the read amount to fit into this register
            if (register_offset + read_amount > HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25){
                read_amount = HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25 - register_offset;
            }

            ret = gd25_secure_register_read(otp_page, register_offset, &data_buf[data_read], read_amount);

            // Increment/decrement counter variables, increment to the next OTP register
            data_to_read -= read_amount;
            data_read += read_amount;
            otp_page++;
        }
    } else {
        ret = mx25_enter_secure_otp();
        if (!ret) {
            ret = hal_exflash_read(addr, data_buf, data_size);
        }
        mx25_exit_secure_otp(); 
    }

    return ret;
}

int hal_exflash_write_special(hal_exflash_special_sector_t sp, uintptr_t addr, const uint8_t* data_buf, size_t data_size) {
    const hal_exflash_params_t* flash_params = hal_exflash_get_params(flash_type);
    CHECK_TRUE(flash_params, SYSTEM_ERROR_NOT_FOUND);

    CHECK_TRUE(sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addr + data_size <= flash_params->otp_size, SYSTEM_ERROR_OUT_OF_RANGE);
    CHECK_TRUE(data_buf != nullptr, SYSTEM_ERROR_INVALID_ARGUMENT);
    int ret = 0;

    FlashLock lk;

    if (flash_type == HAL_QSPI_FLASH_TYPE_GD25WQ64E) {
        // Determine which OTP Register to start writing to
        size_t otp_page = addr / HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
        size_t data_to_write = data_size;
        size_t data_written = 0;
        size_t write_amount = 0;

        while (data_to_write && !ret) {
            // Determine the offset of the current OTP register to start writing at
            size_t register_offset = (addr + data_written) % HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
            write_amount = data_to_write;

            // If the data remaining to write extends into the next register, truncate the write amount to fit into this register
            if (register_offset + write_amount > HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25){
                write_amount = HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25 - register_offset;
            }

            ret = gd25_secure_register_write(otp_page, register_offset, &data_buf[data_written], write_amount);

            // Increment/decrement counter variables, increment to the next OTP register
            data_to_write -= write_amount;
            data_written += write_amount;
            otp_page++;
        }
    } else {
        ret = mx25_enter_secure_otp();
        if (!ret) {
            ret = hal_exflash_write(addr, data_buf, data_size);
        }
        mx25_exit_secure_otp();
    }

    return ret;
}

int hal_exflash_erase_special(hal_exflash_special_sector_t sp, uintptr_t addr, size_t size) {
    /* We only support OTP sector and since it's One Time Programmable, we can't erase it */
    return SYSTEM_ERROR_NOT_SUPPORTED;
}

int hal_exflash_special_command(hal_exflash_special_sector_t sp, hal_exflash_command_t cmd, const uint8_t* data, uint8_t* result, size_t size) {
    FlashLock lk;

    /* General commands */
    if (sp == HAL_EXFLASH_SPECIAL_SECTOR_NONE) {
        nrf_qspi_cinstr_conf_t cinstr_cfg = {
            .opcode    = 0x00,
            .length    = NRF_QSPI_CINSTR_LEN_1B,
            .io2_level = true,
            .io3_level = true,
            .wipwait   = true,
            .wren      = true
        };

